module.exports = {
  private_chat_message:
    "Щоб надіслати заявку, напишіть мені в особисті повідомлення 👇",
  private_chat_btn: "✉️ Написати боту",

  keep_btn: "➡️ Залишити без змін",

  main_menu_text:
    "Привіт! 👋 Я бот Serwis S.O.M. \nДопоможу надіслати заявку або запит на розрахунок вартості.",

  name_question: "Введіть ваше ім’я (не менше {min} літер):",
  phone_question: "Введіть номер телефону:\n{length} цифр без пробілів (наприклад: 500600700)\n\n(або скористайтеся кнопкою внизу, щоб поділитися контактом)",
  car_name_question:
    "Введіть марку та модель авто (наприклад, Volkswagen Golf):",
  engine_question: "Введіть тип двигуна (наприклад, 1.4 TSI, 2.0 TDI):",
  vin_question: "Введіть VIN-номер (можна пропустити):",
  problem_question: "Опишіть проблему або послугу (не менше {min} символів):",

  name_error:
    "Імʼя має містити не менше {min} літер i не повинно містити цифр.",
  phone_error: "Номер телефону має містити рівно {length} цифр (без пробілів).",
  car_name_error: "Марка та модель авто мають містити не менше {min} символів.",
  engine_error: "Опис двигуна має містити не менше {min} символів.",
  vin_error:
    "VIN повинен містити {min} символів i не включати літери I, O та Q.",
  problem_error: "Опис має містити не менше {min} символів.",

  send_request_btn: "📄 Надіслати заявку або запит",
  change_lang_btn: "🌐 Змінити мову",
  choose_lang: "Оберіть мову:",
  lang_pl: "🇵🇱 Polski",
  lang_en: "🇬🇧 English",
  lang_uk: "🇺🇦 Українська",
  lang_ru: "🇷🇺 Русский",
  lang_saved: "✅ Мову змінено.",

  summary_title: "📋 Перевірте дані:",
  summary_name: "👤 Імʼя",
  summary_phone: "📞 Телефон",
  summary_car: "🚗 Авто",
  summary_engine: "⚙️ Двигун",
  summary_vin: "🔢 VIN",
  summary_problem: "🛠 Опис проблеми або послуги",

  summary_send_btn: "✅ Відправити",
  summary_edit_btn: "✏️ Редагувати",
  summary_reset_btn: "❌ Відмінити",
  summary_reset_done: "✅ Заявку відмінено.",
  summary_sent: "✅ Заявку надіслано.\nМи зв’яжемося з вами у робочий час сервісу.",

  session_lost:
    "Виникла технічна проблема, і поточну заявку було перервано.\nДавайте почнемо спочатку — це займе лише кілька хвилин.",
  skip_btn: "➡️ Пропустити",
  request_sending_error: "❌ Не вдалося надіслати заявку. Спробуйте пізніше.",
  send_contact_btn: "📞 Надіслати мій номер телефона",
  summary_call_button: "📞 Зателефонувати клієнту",
};
